{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "name": "emb_in", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 12186, "batch_input_shape": [null, 15], "W_regularizer": null, "dropout": 0.0, "output_dim": 300, "input_length": 15}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dr1_in"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "con1_in", "activity_regularizer": null, "trainable": true, "filter_length": 2, "init": "uniform", "bias": true, "nb_filter": 150, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "pool1_in", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dr2_in"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatin"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "den1_in", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dr3_in"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "den2_in", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 6}}]}